---
kind: method
id: M:Autodesk.Revit.DB.Mechanical.MEPBuildingConstruction.GetBuildingConstruction(Autodesk.Revit.DB.Analysis.ConstructionType)
source: html/c4a62707-01bd-a107-ccad-5cf499d79e25.htm
---
# Autodesk.Revit.DB.Mechanical.MEPBuildingConstruction.GetBuildingConstruction Method

Gets the current Building Construction from the project information.

## Syntax (C#)
```csharp
public Construction GetBuildingConstruction(
	ConstructionType constructionType
)
```

## Parameters
- **constructionType** (`Autodesk.Revit.DB.Analysis.ConstructionType`) - The Construction Type of Building Construction.

## Returns
The Building Construction of the Project Information.

## Remarks
This function is used to get the Building Construction of the Project Information.